{
  "scary-and-amazing-security-things": {
    "layout": "../_tech_post",
    "date": "December 18, 2003",
    "title": "Scary and Amazing Security Things",
    "excerpt": "I'm working on getting ready for my precompiler at CodeMash in just a few weeks and I'm incredibly excited. Last year I had a blast presenting along side Bill and talking with many in the developer and security community.",
    "categories": ["Conferences"],
    "tags": ["security", "codemash"]
  },
  "offensive-forensicscsi-for-the-bad-guy": {
    "layout": "../_tech_post",
    "date": "August 5, 2003",
    "title": "Offensive Forensics/CSI for the Bad Guy",
    "excerpt": "This talk was interesting as it relates to some of the forensics work I've been doing for my day job, however the premise was that rather than using it (forensics techniques) to uncover illegal activity, it can be used for uncovering material important for pen testing/red teaming. They gave some examples from real-world pen tests that they have worked on where they were bit by having not used these tactics, and some wherein they were benefited by having used them.",
    "categories": ["Conferences"],
    "tags": ["security", "defcon"]
  },
  "all-your-rfz-belong-to-me": {
    "layout": "../_tech_post",
    "date": "August 5, 2003",
    "title": "All Your RFz Belong To Me",
    "excerpt": "This was one of the best sessions that I attended at DefCon, and was also the longest (double-length). The room was packed, and the aroma “fresh”... however the content made up for all of that. Essentially, the guy is an RF nerd who, utilizing old-style equipment and now SDR, pokes around with (i.e. listens to) signals in the air and tries to figure out what they are.",
    "categories": ["Conferences"],
    "tags": ["security", "defcon"]
  },
  "wireless-penetration-testing-101": {
    "layout": "../_tech_post",
    "date": "August 2, 2003",
    "title": "Wireless Penetration Testing 101",
    "excerpt": "I attended this session as my last of the day, and honestly didn't expect much. As some of you know, I have spoken on wireless pen testing a handful of times, have done some training and certification work, and generally feel like I know the basics fairly well.",
    "categories": ["Conferences"],
    "tags": ["security", "defcon"]
  },
  "decrypting-def-con": {
    "layout": "../_tech_post",
    "date": "August 2, 2003",
    "title": "Decrypting DEF CON",
    "excerpt": "This talk was given by one of the head guys of the con, specifically the guy responsible for the human badge challenge. He talked a bit about himself, the way he views the world, and gave some hints as to how one might go about solving some of the challenges associated with the badges, the lanyards, the stickers on the floor of the con, etc. ",
    "categories": ["Conferences"],
    "tags": ["security", "defcon"]
  },
  "oil-gas-infosec-101": {
    "layout": "../_tech_post",
    "date": "August 2, 2003",
    "title": "Oil & Gas Infosec 101",
    "excerpt": "This talk was from a seasoned security professional working in the Oil & Gas industry (18+ years). It was by no means a terribly dramatic presentation, and the speaker was sort of \"finding his way\", however I found the talk very educational. He identified a number of ways in which early assumptions were made when the technology landscape was more innocent, and how these assumptions are now the source of significant risks.",
    "categories": ["Conferences"],
    "tags": ["security", "defcon"]
  },
  "pentesters-toolkit": {
    "layout": "../_tech_post",
    "date": "August 1, 2003",
    "title": "Pentesters Toolkit",
    "excerpt": "The second session I attended was called the Pentesters Toolkit and was designed to walk us through the \"bag\" that a seasoned pentester carries with him on most any job. This was very practical and I enjoyed the session. More interesting to me, was that my normal \"kit\" includes nearly everything mentioned.",
    "categories": ["Conferences"],
    "tags": ["security", "defcon"]
  },
  "my-first-def-con": {
    "layout": "../_tech_post",
    "date": "August 1, 2003",
    "title": "My First DEF CON",
    "excerpt": "This is my first defcon. I'm going to post a few things here about my experiences, primarily as a means of storing the data for my own purposes later on. Maybe it will be of some use to others.",
    "categories": ["Conferences"],
    "tags": ["security", "defcon"]
  },
  "big-data-101-handling-millions-of-files": {
    "layout": "../_tech_post",
    "date": "February 2, 2003",
    "title": "Big Data 101: Handling Millions of Files",
    "excerpt": "I've been talking a bit recently with members of my team about some of the basic tools that need to be in any data scientist's toolbox. Things that, if you want to lay any claim to working with \"big data\" should be second nature. Many of these things are not terribly complicated, nor does one have to be overly clever to employ them - however the lack of knowledge as to when to properly apply them could cost you dearly (lost time, lost data, needless system maintenance, etc).",
    "categories": ["theory"],
    "tags": ["bigdata"]
  },
  "index" : {
    "layout": "index"
  }
}

