{
  "you-cant-handle-the-truth": {
    "layout": "_tech_post",
    "date": "August 14, 2014",
    "title": "You Can't Handle The Truth",
    "excerpt": "This week I spent a few days in Dallas, TX at the Crimes Against Children conference. I started to say \"I was privileged to attend…\" but I'm not certain that imparts the appropriate gravity to the conference. This week wasn't a party. It wasn't a \"good time\". It wasn't fun. It was work. Hard work. I found myself having to force myself to attend the sessions."
  },

  "codestock-2014": {
    "layout": "_tech_post",
    "date": "July 11, 2014",
    "title": "CodeStock 2014",
    "excerpt": "I'm pleased to have been asked to speak at at CodeStock 2014 this year. I'm giving two talks... one on Password security, cracking and related items and another on Hiding in Plain Site. I've been able to take some time to re-work both of these talks and extend them a bit."
  },
  "tracking-planes-on-vacation": {
    "layout": "_tech_post",
    "date": "June 13, 2014",
    "title": "Tracking Planes on Vacation",
    "excerpt": "We spent the past week with our extended family at a cabin in the TN mountains. We do this every year or so, and - as we normally do - we had a blast. On one of our \"in\" days, I had planned to work through an experiment with the kids to show the difference between the stock antenna for tracking airplanes via ADS-B and a custom-built antenna. We followed a number of online tutorials and used a bunch of open source software. I have posted below are the links for some of these tools and parts in case you want to do the same with your kids. I hope you have as much fun as we did!"
  },
  "index" : {
    "layout": "index",
    "_2004": {
      "net-framework-11-sp1-and-mps-the-real-story": {
        "layout": "../_tech_post",
        "date": "September 24, 2004",
        "title": ".NET Framework 1.1 sp1 and MPS - the real story",
        "excerpt": "I've been contacted recently by a number of people regarding a recent scare about installing the service pack 1 for the .NET framework 1.1 on a system running MPS.  This issue has been fueled by the fact that Ensim had released a concern about the patch for their customers, and there have been a number of people reporting problems using the Configuration Wizard for MPS with the service pack.  So, let's get the facts out.",
        "categories": ["Provisioning"],
        "tags": [
          ".net",
          "mps"
        ]
      },
      "forwarding-a-users-mailbox-via-mps": {
        "layout": "../_tech_post",
        "date": "July 28, 2004",
        "title": "Forwarding a user's mailbox via MPS",
        "excerpt": "I was recently contacted by a client inquiring how to forward a user's mail using MPS.  There is no specific \"provider method\" for this, but it is actually very easy using the Managed Active Directory::ModifyUser method. ",
        "categories": ["Provisioning"],
        "tags": ["mps"]
      },
      "miis-password-sync": {
        "layout": "../_tech_post",
        "date": "June 30, 2004",
        "title": "MIIS - password sync?",
        "excerpt": "As a member of the development community, it seems almost requisite to comment on the newly-released Visual Studio 2005 beta 1 products.  I learned of the release while on client site participating in a discovery project for a MPS rollout.  One of the things the client was concerned about was the ability to \"drive\" the provisioning system from their current *nix-based SOP system.",
        "categories": ["General Development", "Provisioning"],
        "tags": ["miis"]
      },
      "mps-and-vs-2005": {
        "layout": "../_tech_post",
        "date": "June 30, 2004",
        "title": "MPS and VS 2005",
        "excerpt": "As a member of the development community, it seems almost requisite to comment on the newly-released Visual Studio 2005 beta 1 products.  I learned of the release while on client site participating in a discovery project for a MPS rollout.  One of the things the client was concerned about was the ability to \"drive\" the provisioning system from their current *nix-based SOP system.",
        "categories": ["Provisioning"],
        "tags": ["mps", "vs2005"]
      },
      "net-based-dac-and-role-security": {
        "layout": "../_tech_post",
        "date": "May 26, 2004",
        "title": ".NET-based dac and role security",
        "excerpt": "I'm continuing to work on a .NET version of the DAC (Delegated Administration Console) - essentially a UI front-end for the Microsoft provisioning System and specifically Hosted Exchange 2003.1... I've been learning a number of things and experimenting with some very interesting (at least to me) technologies.  I thought I'd share a little here and maybe post some more detail on each of these items over the next couple of weeks.",
        "categories": ["Provisioning"],
        "tags": [".net", "c#"]
      },
      "first-hack-at-globalization-and-localization": {
        "layout": "../_tech_post",
        "date": "April 30, 2004",
        "title": "First hack at globalization and localization",
        "excerpt": "So I've been working on a test of the .NET globalization/localization techniques for ASP.NET (v1.1) and have been having relatively mixed results.  The documentation and step-by-step examples have been a bit weak and the documentation for this area of the framework does not seem nearly as robust as other topics. This perception might be, however, just from my lack of true understanding of how this is all supposed to work and the associated terminology.",
        "categories": ["General Development"],
        "tags": ["asp.net"]
      },
      "welcome-to-the-blog": {
        "layout": "../_tech_post",
        "date": "January 28, 2004",
        "title": "Welcome to the blog",
        "excerpt": "People use their blogs for all sorts of different things, I intend for mine to be a sort of “diary” of my work as I learn/increase my learning of a certain few Microsoft Technologies: MPF, BTS, C#, .NET, Whidbey, and Yukon.",
        "categories": ["Miscellaneous"],
        "tags": ["personal"]
      }
    },
    "_2005": {
      "pdc05-dotnetnuke-the-migration-to-aspnet-20": {
        "layout": "../_tech_post",
        "date": "September 13, 2005",
        "title": "PDC05: DotNetNuke - The Migration to ASP.NET 2.0",
        "excerpt": "The last session I attended today was called a \"Birds of a feather\" session... this is much less formal and is sort of a community-style meeting. This session was great as I had many questions and the opportunity to sit and listen to the authors of DNN discuss their thoughts and directions for the product, as well as to see that they are truly interested in the feedback from the community was simply great.",
        "categories": ["Conferences", "General Development"],
        "tags": ["asp.net"]
      },
      "pdc05-extending-visual-studio-with-add-ins-and-packages": {
        "layout": "../_tech_post",
        "date": "September 13, 2005",
        "title": "PDC05: Extending Visual Studio with Add-ins and Packages",
        "excerpt": "The last “main” session I attended today was on extending the Visual Studio .NET IDE.  This session was of particular interest to me as I’ve dabbled with the VSIP for quite some time now and never been able to get anything truly of interest working.  I listened intently as they described the improvements in the VSIP (now the VS.NET SDK) in the latest versions.",
        "categories": ["Conferences", "General Development"],
        "tags": ["visualstudio"]
      },
      "pdc05-choosing-the-right-presentation-technology": {
        "layout": "../_tech_post",
        "date": "September 13, 2005",
        "title": "PDC05: Choosing the Right Presentation Technology",
        "excerpt": "The second break-out session I attended today was called “Choosing the Right Presentation Technology: Windows Presentation Foundation (\"Avalon\"), Windows Forms, ASP.NET, IE, and More”.  The speaker was great and really seemed to know his stuff.",
        "categories": ["Conferences"],
        "tags": ["wpf"]
      },
      "pdc05-windows-communications-foundation-indigo": {
        "layout": "../_tech_post",
        "date": "September 13, 2005",
        "title": "PDC05: Windows Communications Foundation (\"Indigo\")",
        "excerpt": "Because the keynote went long today, they rescheduled the lunch sessions so my second session of the day was called Windows Communications Foundation (\"Indigo\"): A Lap around the Windows Communications Foundation. Unfortunately, I felt the session was nearly a complete waste of time.  Besides the fact that the speaker seemed less than prepared (truly seemed surprised by some of his demo results), the demo and content did not “gell” well. ",
        "categories": ["Conferences"],
        "tags": ["wcf"]
      },
      "pdc05-day-1-keynote": {
        "layout": "../_tech_post",
        "date": "September 13, 2005",
        "title": "PDC05: Day 1 Keynote",
        "excerpt": "The keynote for PDC05 today was great.  It started out with Bill Gates (this is the first time I’ve heard him speak in person).  He was followed by Jim Alchin.  Between the two of them, we saw some great demos and heard some really encouraging things.  The following is a list of key points that I came away with from the session:",
        "categories": ["Conferences"],
        "tags": ["fun"]
      },
      "im-at-pdc": {
        "layout": "../_tech_post",
        "date": "September 12, 2005",
        "title": "I'm at PDC!",
        "excerpt": "Well, not actually, but I’m close.  I’m certain that there will be a ton of people posting about PDC05, and those who attended the pre-sessions probably already are.  I arrived this afternoon in time to go down and get registered so I can skip that in the morning… I’ve been spending this evening working through the schedule and trying to determine which sessions to go to (there are so many!).",
        "categories": ["Conferences"],
        "tags": ["fun"]
      },
      "writing-mpf-schemas-is-easier-now-using-vs-2005": {
        "layout": "../_tech_post",
        "date": "July 19, 2005",
        "title": "Writing MPF Schemas is easier now using VS 2005",
        "excerpt": "I know many people do not take the time to include schemas in their MPF named procedures, but I am a big fan.  Here at eQuest, we use these in-line schemas for all sorts of things ranging from auto-generating CHM files to auto-generating strongly-typed C# and XML Web Service wrappers.",
        "categories": ["Provisioning"],
        "tags": ["mps", "vs2005"]
      },
      "web-service-studio": {
        "layout": "../_tech_post",
        "date": "April 22, 2005",
        "title": "Web Service Studio",
        "excerpt": "Those of you who interact with and develop XML web services on a regular basis are probably very familiar with this tool or have other tools that you have purchased/developed to provide similar functionality, but I came across the Web Service Studio",
        "categories": ["General Development"],
        "tags": ["tools"]
      },
      "visualstudionet2005beta2firstexperience-reallygood": {
        "layout": "../_tech_post",
        "date": "April 21, 2005",
        "title": "VisualStudio.Net.2005.Beta2(firstExperience) == Really.Good;",
        "excerpt": "Wow… early this morning was the first time that I was really able to spend some time with the new Visual Studio 2005 beta… and let me join the majority of the blogsphere in saying that I’m quite impressed.  My task today was a simple one… that of converting a primarily content-focused website that I had build using Dreamweaver MX to ASP.NET 2.0.  The following are some general impressions…",
        "categories": ["General Development"],
        "tags": ["vs2005", "tools"]
      },
      "so-infopath-is-useful": {
        "layout": "../_tech_post",
        "date": "January 23, 2005",
        "title": "So... InfoPath IS useful....",
        "excerpt": "One of the unfortunate realities of being a busy consultant and developer is that your exposure to technologies and tools are often limited to what you have to have to use to get your job done, or what your client needs and/or is interested in.  Obviously, you work hard to keep yourself exposed to as much and varied technology as possible, however some things invariably slip through the cracks.",
        "categories": ["General Development"],
        "tags": ["infopath", "tools"]
      }
    },
    "_2006": {
      "aspnet-20-debugging-steps-i-should-really-know": {
        "layout": "../_tech_post",
        "date": "November 8, 2006",
        "title": "ASP.NET 2.0 Debugging steps I should really know",
        "excerpt": "As part of my \"not-my-real-job\" time, I do a little website hosting - basically to keep my hands dirty with the problem space and to increase my visibility into the windows hosting space. One of the sites we host updated their site this past week with a new CMS platform and the site failed to work. On the site owners development machine the site worked fine... on my dev/test machine the site worked fine but on the production server it failed every time.",
        "categories": ["General Development"],
        "tags": ["asp.net"]
      },
      "vs-2005-project-subtypes": {
        "layout": "../_tech_post",
        "date": "June 15, 2006",
        "title": "VS 2005 Project Subtypes",
        "excerpt": "I’ve had the opportunity lately to work on a project that needed to generate some code for a project based on a given file within the project and then include/add those files to the project for inclusion during build. We spent a good bit of time looking at the various options such as custom MSBuild tasks, add-ins, VSPackages, etc. and finally settled on a Visual Studio Package that implemented a project subtype, a custom project property page, and a custom tool (single-file generator).",
        "categories": ["General Development"],
        "tags": ["vs2005"]
      },
      "mps-sdk-part-2-of": {
        "layout": "../_tech_post",
        "date": "June 5, 2006",
        "title": "MPS SDK Part 2 of ?",
        "excerpt": "I am preparing to give a talk/introduction to the MPS SDK at the end of this week based on the outline below. I thought I'd list some of the thoughts/comments here under each of the points as a general resource for anyone interested. In this post, I'll list my outline and then expand on the first points with subsequent posts expanding on the remaining points.",
        "categories": ["Provisioning"],
        "tags": ["mps"]
      },
      "new-sdk-for-the-microsoft-provisioning-system": {
        "layout": "../_tech_post",
        "date": "May 26, 2006",
        "title": "New SDK for the Microsoft Provisioning System!",
        "excerpt": "I’ve recently received clearance to discuss a project I’ve been working on for quite awhile – a new SDK for the Microsoft Provisioning System. This is something that has been a goal of mine for a number of years, and if you have done any significant development for/with MPS you will be glad to hear that the developer tool set is finally going to be shipping (no, don’t ask me when – but it shouldn’t be too long).",
        "categories": ["Provisioning"],
        "tags": ["mps"]
      },
      "using-xsd-in-your-c-and-mps-programming": {
        "layout": "../_tech_post",
        "date": "January 14, 2006",
        "title": "Using XSD in your C# and MPS programming...",
        "excerpt": "So I need to begin this post by admitting that I’m relatively new to the XSD world… particularly as it applies to C#. While I’ve done a significant amount of Xml programming and manipulation in C#, my recent forays into this technology cause me to reconsider my belief that I’m an experienced Xml programmer…",
        "categories": ["General Development"],
        "tags": ["c#", "mps"]
      }
    },
    "_2007": {
      "what-im-looking-for": {
        "layout": "../_tech_post",
        "date": "November 1, 2007",
        "title": "What I'm looking for...",
        "excerpt": "In a number of the posts I've been writing on the SOA/BPM conference I've referred to the applicability (or lack thereof) of a given approach to \"the problem set\" that I'm currently working on. I thought it might be good to describe what it is that I'm looking for and a little bit as to why.",
        "categories": ["Conferences"],
        "tags": ["bpm", "soa"]
      },
      "msftbpmsoa-session-6": {
        "layout": "../_tech_post",
        "date": "November 1, 2007",
        "title": "MSFT/BPM/SOA Session 6",
        "excerpt": "The sixth session I attended was entitled \"Next Generation Business Applications\" and was presented by Mike Walker of the Architecture Strategy Team (MSFT).",
        "categories": ["Conferences"],
        "tags": ["sharepoint", "soa"]
      },
      "msftbpmsoa-session-5": {
        "layout": "../_tech_post",
        "date": "November 1, 2007",
        "title": "MSFT/BPM/SOA Session 5",
        "excerpt": "This session was titled: \"The Human-Facing SOA: Realizing the Value of Web Services with Microsoft Office SharePoint Server 2007\" presented by Hugh Taylor (Senior Marketing Manager, MSFT)",
        "categories": ["Conferences"],
        "tags": ["sharepoint", "soa"]
      },
      "msftbpmsoa-session-4": {
        "layout": "../_tech_post",
        "date": "October 31, 2007",
        "title": "MSFT/BPM/SOA Session 4",
        "excerpt": "The fourth session I attended was titled \"BPM Best of Breed: Accenture, Avanade, IDS Scheer, and Microsoft - Delivering Closed Loop BPM\" and was presented by Brian Wilkinson (Accenture), Altan Enginaleve (IDS Scheer) and Dana Kaufman (Microsoft).",
        "categories": ["Conferences"],
        "tags": ["sharepoint", "soa"]
      },
      "msftbpmsoa-session-3": {
        "layout": "../_tech_post",
        "date": "October 31, 2007",
        "title": "MSFT/BPM/SOA Session 3",
        "excerpt": "The third session I attended was a lunch session sponsored by K2 (http://www.k2.com). I was looking forward to this presentation as I've heard quite a bit about K2, and they've been doing workflow in SharePoint long before MSFT was.",
        "categories": ["Conferences"],
        "tags": ["sharepoint", "soa"]
      },
      "msftbpm-session-2": {
        "layout": "../_tech_post",
        "date": "October 31, 2007",
        "title": "MSFT/BPM Session 2",
        "excerpt": "The section session I attended was entitled \"People-Read Processes with SharePoint Workflows and Forms Services\" and was presented by Christian Stark, a Senior Product Manager for Microsoft.",
        "categories": ["Conferences"],
        "tags": ["soa"]
      },
      "msftbpm-session-1": {
        "layout": "../_tech_post",
        "date": "October 31, 2007",
        "title": "MSFT/BPM Session 1",
        "excerpt": "Today started out with the keynote for the conference and it was certainly not disappointing. The following is basically a brain dump of the information presented along with some commentary.",
        "categories": ["Conferences"],
        "tags": ["soa"]
      },
      "microsofts-fifth-annual-soa-and-bpm-conference": {
        "layout": "../_tech_post",
        "date": "October 30, 2007",
        "title": "Microsoft's Fifth Annual SOA and BPM Conference",
        "excerpt": "I'm in Redmond this week attending Microsoft's fifth annual SOA and BPM conference. It's pretty interesting so far, and I'm intending on writing a number of different posts (one per session that I attend). For the last nine months I've been working in the federal IT",
        "categories": ["Conferences"],
        "tags": ["soa"]
      },
      "base-template-for-moss-master-pages": {
        "layout": "../_tech_post",
        "date": "April 19, 2007",
        "title": "Base Template for MOSS Master Pages",
        "excerpt": "I'm posting this more for my own benefit (able to find it later) than anything, but while working on a master page customization for a client I stumbled across a posting on MSDN on how to create a minimal master page",
        "categories": ["General Development"],
        "tags": ["sharepoint"]
      },
      "why-cant-i-create-a-master-page-in-the-site-collection": {
        "layout": "../_tech_post",
        "date": "April 19, 2007",
        "title": "Why Can't I Create a Master Page in the Site Collection???",
        "excerpt": "Chalk it up to being a newbie at SharePoint v3/MOSS 2007 development, but I expected that since I was a site \"owner\" of both a sub-site as well as the site collection that I should be able to create a master page using SPD and save it to the site collection's master page gallery",
        "categories": ["General Development"],
        "tags": ["sharepoint"]
      },
      "sql-server-2005-compact-edition-kudos-to-the-sql-team": {
        "layout": "../_tech_post",
        "date": "January 24, 2007",
        "title": "SQL Server 2005 Compact Edition - Kudos to the SQL Team",
        "excerpt": "If you track the Microsoft or ASP.NET weblogs you've surely noticed that roughly two weeks ago now Microsoft released SSCE or SQL Server 2005 Compact Edition. Rather than simply saying \"they released it, go download it because it's cool\" I want to openly thank the SQL team for providing a very interesting product.",
        "categories": ["General Development"],
        "tags": ["sql"]
      }
    },
    "_2008": {
      "project-templates-for-sharepoint-development": {
        "layout": "../_tech_post",
        "date": "December 9, 2008",
        "title": "Project Templates for SharePoint Development",
        "excerpt": "I've had the privilege of working with an organization for almost two years now doing alot of SharePoint development. There's a team of approximately 75 developers that cover the gamut of skill sets and experiences, most of whom are working, to some degree, with C# and SharePoint development. One of the things that has come up repeatedly, is \"how do I get started\"? or \"what project template should I be using\"? These are good questions without a completely clear answer. This post (and hopefully some following) are intended to discuss what we are using, how it evolves, what options we discarded, and why. I spent last Friday teaching a class attempting to bring our team up to speed as to how to structure their SharePoint solutions/projects in VS and get them integrated with Team Build and packaged for deployment in our organization.",
        "categories": ["SharePoint"],
        "tags": [".net", "sharepoint", "teamsystem"]
      },
      "net-is-a-smorgasbord": {
        "layout": "../_tech_post",
        "date": "November 26, 2008",
        "title": ".NET is a Smorgasbord?",
        "excerpt": "Like many other .NET devs I often find myself expecting to be current in all of the existing and up-coming tools/technologies in the Microsoft/.NET platform. Frankly, I don't know how that is possible, especially with the pace at which MSFT (not to mention the surrounding ecosystem) is releasing tools and platforms. Over the past few years, my approach has been to know \"enough\" about the various tools/technologies so that I can be conversant, and also know when a particular toolset applies to my current project, thereby warranting a \"deeper\" dive into that area",
        "categories": ["General Development"],
        "tags": [".net", "wcf", "wpf"]
      },
      "does-the-cloud-help-the-public-sector": {
        "layout": "../_tech_post",
        "date": "October 29, 2008",
        "title": "Does the “Cloud” help the Public Sector?",
        "excerpt": "I’m here at PDC 2008 and having a rather good time attending sessions, talking with experts, speaking with vendors, etc. It has been a pretty good conference and I’ve done a better job than previously at managing my ability to pay attention (i.e. I don’t necessarily *have* to attend a session during every available slot, and, amazingly, there’s a good chance that taking a break b/t will help me pay attention better at the next one",
        "categories": ["Cloud Computing", "Conferences"],
        "tags": ["cloud", "pdc2008"]
      },
      "isnt-it-time-for-64bit": {
        "layout": "../_tech_post",
        "date": "September 3, 2008",
        "title": "Isn’t it Time for 64Bit?",
        "excerpt": "I’m getting frustrated with application vendors and their support for 64-bit OSs. I’d admit that a year or two ago the consumer-level device support for 64-bit OSs was a bit weak, but considering I can now walk into Best Buy and pick up a consumer-grade laptop that runs Vista 64, the major software vendors really need to get their act together. In the last few weeks I’ve been bitten by a “we don’t support 64-bit” story a number of times and it feels ridiculous",
        "categories": ["Theory"],
        "tags": ["rant"]
      },
      "thinking-the-cloud": {
        "layout": "../_tech_post",
        "date": "July 18, 2008",
        "title": "Thinking the Cloud…",
        "excerpt": "I’ve been talking quite a bit with a co-worker about “the cloud” and how organizations can and will leverage it over time, and how application development/design may change as a result. Microsoft’s SQL Server Data Services (SSDS) is only one example of a major paradigm shift in the industry away from internal-only systems to treating certain things as commodity-style resources.",
        "categories": ["Cloud Computing", "Theory"],
        "tags": ["theory"]
      },
      "stop-re-inventing-the-wheel": {
        "layout": "../_tech_post",
        "date": "June 22, 2008",
        "title": "Stop (re-)Inventing the Wheel!",
        "excerpt": "In my “day job”, I’m working with an organization wherein we are coaching a group of about 80 developers to view opening Visual Studio as their last viable option when looking to solve a problem. This doesn’t mean coding is bad (I certainly hope not… if so, I think I’d be out of a job soon), but rather represents a mind-set that recognizes that we have an enormous collection of functionality/tools already available to us (we are building on top of MOSS 2007) and we need to fully vet the OOTB functionality prior to deciding we need to “roll our own” anything.",
        "categories": ["Theory", "SharePoint"],
        "tags": ["moss", "sharepoint", "theory", "windows live"]
      },
      "finally-back-where-i-want-to-be": {
        "layout": "../_tech_post",
        "date": "May 26, 2008",
        "title": "Finally back where I want to be...",
        "excerpt": "It's frustrating to me to find myself redoing things that I've done before or re-solving problems. Over the years at Planet I've been involved with different software teams each with different levels of rigor, however most all of them have had, at minimum, an automated build process of some sort (at least for the past 4 years or so). Some of these systems were elaborate msbuild driven systems while others were a cobbling together of batch scripts or PowerShell linking msbuild, Vault, FogBugz and Community server,",
        "categories": ["General Development", "SharePoint"],
        "tags": ["build", "tfs", "visualstudio"]
      }
    },
    "_2009": {
      "silverlight-and-azure-table-data-paging": {
        "layout": "../_tech_post",
        "date": "August 5, 2009",
        "title": "Silverlight and Azure Table Data Paging",
        "excerpt": "I’m playing around with a data visualization app using Silverlight and data hosted in Azure Tables and have been learning quite a bit in the process. Firstly, Azure tables only allows you to return 1000 records in a given query. If you issue a query that has a larger matching result set, Azure will return some extra headers indicating as such (x-ms-continuation-NextPartitionKey and x-ms-continuation-NextRowKey).",
        "categories": ["Cloud Computing"],
        "tags": ["azure", "cloud", "silverlight"]
      },
      "azure-blob-storage-blob-ids-and": {
        "layout": "../_tech_post",
        "date": "July 30, 2009",
        "title": "Azure Blob Storage Blob IDs and “+”",
        "excerpt": "I’d like to thank all of you who attended my session today at CodeStock. I had a great time talking with you all and sharing my experiences with SharePoint and TFS with you all.",
        "categories": ["Cloud Computing", "General Development"],
        "tags": ["azure", "cloud"]
      },
      "codestock-session": {
        "layout": "../_tech_post",
        "date": "June 26, 2009",
        "title": "Codestock Session",
        "excerpt": "I’d like to thank all of you who attended my session today at CodeStock. I had a great time talking with you all and sharing my experiences with SharePoint and TFS with you all.",
        "categories": ["Conferences", "SharePoint"],
        "tags": [".net", "build", "codestock", "sharepoint", "tfs"]
      },
      "customizations-to-stsdev-13": {
        "layout": "../_tech_post",
        "date": "June 23, 2009",
        "title": "Customizations to STSDev 1.3",
        "excerpt": "I’m working on a project which has as one of its goals the “publishing” of some very large datasets (order of 1PB) to the “cloud” for consumption by the general populous for use in scientific research. Rather than designing/inventing our own API, our decision has been to provide an interface consistent with the APIs produced by some of the leading cloud storage providers. Our goal would be that if someone is already used to/has tooling to working with cloud data sources such as Amazon’s S3 service or Microsoft’s Azure Blob storage",
        "categories": ["Conferences", "SharePoint"],
        "tags": [".net", "build", "codestock", "sharepoint", "tfs"]
      },
      "speaking-at-codestock": {
        "layout": "../_tech_post",
        "date": "June 22, 2009",
        "title": "Speaking at CodeStock",
        "excerpt": "I’m working on a project which has as one of its goals the “publishing” of some very large datasets (order of 1PB) to the “cloud” for consumption by the general populous for use in scientific research. Rather than designing/inventing our own API, our decision has been to provide an interface consistent with the APIs produced by some of the leading cloud storage providers. Our goal would be that if someone is already used to/has tooling to working with cloud data sources such as Amazon’s S3 service or Microsoft’s Azure Blob storage",
        "categories": ["Conferences"],
        "tags": [".net", "build", "codestock", "moss", "teamsystem", "tfs"]
      },
      "common-api-set-for-cloud-storage": {
        "layout": "../_tech_post",
        "date": "April 9, 2009",
        "title": "Common API Set for Cloud Storage?",
        "excerpt": "I’m working on a project which has as one of its goals the “publishing” of some very large datasets (order of 1PB) to the “cloud” for consumption by the general populous for use in scientific research. Rather than designing/inventing our own API, our decision has been to provide an interface consistent with the APIs produced by some of the leading cloud storage providers. Our goal would be that if someone is already used to/has tooling to working with cloud data sources such as Amazon’s S3 service or Microsoft’s Azure Blob storage",
        "categories": ["Cloud Computing"],
        "tags": ["aws", "azure"]
      },
      "clouds-and-traditional-hosting-companies": {
        "layout": "../_tech_post",
        "date": "March 25, 2009",
        "title": "Clouds and Traditional Hosting Companies",
        "excerpt": "I sat on a conference call yesterday wherein we discussed our thoughts on where the cloud was going and how it was going to impact the “traditional” hoster. Our company has been working with hosters for many  years (I started in 2000 and they had been doing it before that) and have seen cycles of service come and go. It used to be that just providing personal web + email was all you had to do to be successful. Then, the “Application Service Provider” (ASP) model started and morphed into providing business-related services and eventually to where companies outsourced entire portions of their infrastructure (think Hosted Exchange, Hosted CRM, Hosted OCS).",
        "categories": ["Cloud Computing"],
        "tags": ["cloud"]
      },
      "2009-bju-programming-contest": {
        "layout": "../_tech_post",
        "date": "March 24, 2009",
        "title": "2009 BJU Programming Contest",
        "excerpt": "I had the privilege of being one of the alumni-judges at the annual Bob Jones University Computer Science departments programming contest. This was the first time I’ve participated in this type of contest and I found it very interesting. The CS department had a fairly slick harness for executing the contest and supporting the judging in multiple languages and multiple platforms. As with anything of this nature, there were a few bumps in the road, but nothing of any consequence",
        "categories": ["General Development"],
        "tags": ["personal"]
      },
      "misplaced-modifier": {
        "layout": "../_tech_post",
        "date": "March 13, 2009",
        "title": "Misplaced Modifier?",
        "excerpt": "I was on a few websites this morning (go figure) and noticed a handful of visual missteps (mostly minor). One of them was on the Mix 09 conference page and made me chuckle a little.",
        "categories": ["Miscellaneous"],
        "tags": ["fun", "mix"]
      }
    },
    "_2010": {

    },
    "_2011": {

    },
    "_2012": {

    },
    "_2013": {

    },
    "_2014": {

    }
  }
}
