{
  "you-cant-handle-the-truth": {
    "layout": "_tech_post",
    "date": "August 14, 2014",
    "title": "You Can't Handle The Truth",
    "excerpt": "This week I spent a few days in Dallas, TX at the Crimes Against Children conference. I started to say \"I was privileged to attend…\" but I'm not certain that imparts the appropriate gravity to the conference. This week wasn't a party. It wasn't a \"good time\". It wasn't fun. It was work. Hard work. I found myself having to force myself to attend the sessions."
  },

  "codestock-2014": {
    "layout": "_tech_post",
    "date": "July 11, 2014",
    "title": "CodeStock 2014",
    "excerpt": "I'm pleased to have been asked to speak at at CodeStock 2014 this year. I'm giving two talks... one on Password security, cracking and related items and another on Hiding in Plain Site. I've been able to take some time to re-work both of these talks and extend them a bit."
  },
  "tracking-planes-on-vacation": {
    "layout": "_tech_post",
    "date": "June 13, 2014",
    "title": "Tracking Planes on Vacation",
    "excerpt": "We spent the past week with our extended family at a cabin in the TN mountains. We do this every year or so, and - as we normally do - we had a blast. On one of our \"in\" days, I had planned to work through an experiment with the kids to show the difference between the stock antenna for tracking airplanes via ADS-B and a custom-built antenna. We followed a number of online tutorials and used a bunch of open source software. I have posted below are the links for some of these tools and parts in case you want to do the same with your kids. I hope you have as much fun as we did!"
  },
  "index" : {
    "layout": "index",
    "_2004": {
      "net-framework-11-sp1-and-mps-the-real-story": {
        "layout": "../_tech_post",
        "date": "September 24, 2004",
        "title": ".NET Framework 1.1 sp1 and MPS - the real story",
        "excerpt": "I've been contacted recently by a number of people regarding a recent scare about installing the service pack 1 for the .NET framework 1.1 on a system running MPS.  This issue has been fueled by the fact that Ensim had released a concern about the patch for their customers, and there have been a number of people reporting problems using the Configuration Wizard for MPS with the service pack.  So, let's get the facts out.",
        "categories": ["Provisioning"],
        "tags": [
          ".net",
          "mps"
        ]
      },
      "forwarding-a-users-mailbox-via-mps": {
        "layout": "../_tech_post",
        "date": "July 28, 2004",
        "title": "Forwarding a user's mailbox via MPS",
        "excerpt": "I was recently contacted by a client inquiring how to forward a user's mail using MPS.  There is no specific \"provider method\" for this, but it is actually very easy using the Managed Active Directory::ModifyUser method. ",
        "categories": ["Provisioning"],
        "tags": ["mps"]
      },
      "miis-password-sync": {
        "layout": "../_tech_post",
        "date": "June 30, 2004",
        "title": "MIIS - password sync?",
        "excerpt": "As a member of the development community, it seems almost requisite to comment on the newly-released Visual Studio 2005 beta 1 products.  I learned of the release while on client site participating in a discovery project for a MPS rollout.  One of the things the client was concerned about was the ability to \"drive\" the provisioning system from their current *nix-based SOP system.",
        "categories": ["General Development", "Provisioning"],
        "tags": ["miis"]
      },
      "mps-and-vs-2005": {
        "layout": "../_tech_post",
        "date": "June 30, 2004",
        "title": "MPS and VS 2005",
        "excerpt": "As a member of the development community, it seems almost requisite to comment on the newly-released Visual Studio 2005 beta 1 products.  I learned of the release while on client site participating in a discovery project for a MPS rollout.  One of the things the client was concerned about was the ability to \"drive\" the provisioning system from their current *nix-based SOP system.",
        "categories": ["Provisioning"],
        "tags": ["mps", "vs2005"]
      },
      "net-based-dac-and-role-security": {
        "layout": "../_tech_post",
        "date": "May 26, 2004",
        "title": ".NET-based dac and role security",
        "excerpt": "I'm continuing to work on a .NET version of the DAC (Delegated Administration Console) - essentially a UI front-end for the Microsoft provisioning System and specifically Hosted Exchange 2003.1... I've been learning a number of things and experimenting with some very interesting (at least to me) technologies.  I thought I'd share a little here and maybe post some more detail on each of these items over the next couple of weeks.",
        "categories": ["Provisioning"],
        "tags": [".net", "c#"]
      },
      "first-hack-at-globalization-and-localization": {
        "layout": "../_tech_post",
        "date": "April 30, 2004",
        "title": "First hack at globalization and localization",
        "excerpt": "So I've been working on a test of the .NET globalization/localization techniques for ASP.NET (v1.1) and have been having relatively mixed results.  The documentation and step-by-step examples have been a bit weak and the documentation for this area of the framework does not seem nearly as robust as other topics. This perception might be, however, just from my lack of true understanding of how this is all supposed to work and the associated terminology.",
        "categories": ["General Development"],
        "tags": ["asp.net"]
      },
      "welcome-to-the-blog": {
        "layout": "../_tech_post",
        "date": "January 28, 2004",
        "title": "Welcome to the blog",
        "excerpt": "People use their blogs for all sorts of different things, I intend for mine to be a sort of “diary” of my work as I learn/increase my learning of a certain few Microsoft Technologies: MPF, BTS, C#, .NET, Whidbey, and Yukon.",
        "categories": ["Miscellaneous"],
        "tags": ["personal"]
      }
    },
    "_2005": {
      "pdc05-dotnetnuke-the-migration-to-aspnet-20": {
        "layout": "../_tech_post",
        "date": "September 13, 2005",
        "title": "PDC05: DotNetNuke - The Migration to ASP.NET 2.0",
        "excerpt": "The last session I attended today was called a \"Birds of a feather\" session... this is much less formal and is sort of a community-style meeting. This session was great as I had many questions and the opportunity to sit and listen to the authors of DNN discuss their thoughts and directions for the product, as well as to see that they are truly interested in the feedback from the community was simply great.",
        "categories": ["Conferences", "General Development"],
        "tags": ["asp.net"]
      },
      "pdc05-extending-visual-studio-with-add-ins-and-packages": {
        "layout": "../_tech_post",
        "date": "September 13, 2005",
        "title": "PDC05: Extending Visual Studio with Add-ins and Packages",
        "excerpt": "The last “main” session I attended today was on extending the Visual Studio .NET IDE.  This session was of particular interest to me as I’ve dabbled with the VSIP for quite some time now and never been able to get anything truly of interest working.  I listened intently as they described the improvements in the VSIP (now the VS.NET SDK) in the latest versions.",
        "categories": ["Conferences", "General Development"],
        "tags": ["visualstudio"]
      },
      "pdc05-choosing-the-right-presentation-technology": {
        "layout": "../_tech_post",
        "date": "September 13, 2005",
        "title": "PDC05: Choosing the Right Presentation Technology",
        "excerpt": "The second break-out session I attended today was called “Choosing the Right Presentation Technology: Windows Presentation Foundation (\"Avalon\"), Windows Forms, ASP.NET, IE, and More”.  The speaker was great and really seemed to know his stuff.",
        "categories": ["Conferences"],
        "tags": ["wpf"]
      },
      "pdc05-windows-communications-foundation-indigo": {
        "layout": "../_tech_post",
        "date": "September 13, 2005",
        "title": "PDC05: Windows Communications Foundation (\"Indigo\")",
        "excerpt": "Because the keynote went long today, they rescheduled the lunch sessions so my second session of the day was called Windows Communications Foundation (\"Indigo\"): A Lap around the Windows Communications Foundation. Unfortunately, I felt the session was nearly a complete waste of time.  Besides the fact that the speaker seemed less than prepared (truly seemed surprised by some of his demo results), the demo and content did not “gell” well. ",
        "categories": ["Conferences"],
        "tags": ["wcf"]
      },
      "pdc05-day-1-keynote": {
        "layout": "../_tech_post",
        "date": "September 13, 2005",
        "title": "PDC05: Day 1 Keynote",
        "excerpt": "The keynote for PDC05 today was great.  It started out with Bill Gates (this is the first time I’ve heard him speak in person).  He was followed by Jim Alchin.  Between the two of them, we saw some great demos and heard some really encouraging things.  The following is a list of key points that I came away with from the session:",
        "categories": ["Conferences"],
        "tags": ["fun"]
      },
      "im-at-pdc": {
        "layout": "../_tech_post",
        "date": "September 12, 2005",
        "title": "I'm at PDC!",
        "excerpt": "Well, not actually, but I’m close.  I’m certain that there will be a ton of people posting about PDC05, and those who attended the pre-sessions probably already are.  I arrived this afternoon in time to go down and get registered so I can skip that in the morning… I’ve been spending this evening working through the schedule and trying to determine which sessions to go to (there are so many!).",
        "categories": ["Conferences"],
        "tags": ["fun"]
      },
      "writing-mpf-schemas-is-easier-now-using-vs-2005": {
        "layout": "../_tech_post",
        "date": "July 19, 2005",
        "title": "Writing MPF Schemas is easier now using VS 2005",
        "excerpt": "I know many people do not take the time to include schemas in their MPF named procedures, but I am a big fan.  Here at eQuest, we use these in-line schemas for all sorts of things ranging from auto-generating CHM files to auto-generating strongly-typed C# and XML Web Service wrappers.",
        "categories": ["Provisioning"],
        "tags": ["mps", "vs2005"]
      },
      "web-service-studio": {
        "layout": "../_tech_post",
        "date": "April 22, 2005",
        "title": "Web Service Studio",
        "excerpt": "Those of you who interact with and develop XML web services on a regular basis are probably very familiar with this tool or have other tools that you have purchased/developed to provide similar functionality, but I came across the Web Service Studio",
        "categories": ["General Development"],
        "tags": ["tools"]
      },
      "visualstudionet2005beta2firstexperience-reallygood": {
        "layout": "../_tech_post",
        "date": "April 21, 2005",
        "title": "VisualStudio.Net.2005.Beta2(firstExperience) == Really.Good;",
        "excerpt": "Wow… early this morning was the first time that I was really able to spend some time with the new Visual Studio 2005 beta… and let me join the majority of the blogsphere in saying that I’m quite impressed.  My task today was a simple one… that of converting a primarily content-focused website that I had build using Dreamweaver MX to ASP.NET 2.0.  The following are some general impressions…",
        "categories": ["General Development"],
        "tags": ["vs2005", "tools"]
      },
      "so-infopath-is-useful": {
        "layout": "../_tech_post",
        "date": "January 23, 2005",
        "title": "So... InfoPath IS useful....",
        "excerpt": "One of the unfortunate realities of being a busy consultant and developer is that your exposure to technologies and tools are often limited to what you have to have to use to get your job done, or what your client needs and/or is interested in.  Obviously, you work hard to keep yourself exposed to as much and varied technology as possible, however some things invariably slip through the cracks.",
        "categories": ["General Development"],
        "tags": ["infopath", "tools"]
      }
    },
    "_2006": {
      "aspnet-20-debugging-steps-i-should-really-know": {
        "layout": "../_tech_post",
        "date": "November 8, 2006",
        "title": "ASP.NET 2.0 Debugging steps I should really know",
        "excerpt": "As part of my \"not-my-real-job\" time, I do a little website hosting - basically to keep my hands dirty with the problem space and to increase my visibility into the windows hosting space. One of the sites we host updated their site this past week with a new CMS platform and the site failed to work. On the site owners development machine the site worked fine... on my dev/test machine the site worked fine but on the production server it failed every time.",
        "categories": ["General Development"],
        "tags": ["asp.net"]
      },
      "vs-2005-project-subtypes": {
        "layout": "../_tech_post",
        "date": "June 15, 2006",
        "title": "VS 2005 Project Subtypes",
        "excerpt": "I’ve had the opportunity lately to work on a project that needed to generate some code for a project based on a given file within the project and then include/add those files to the project for inclusion during build. We spent a good bit of time looking at the various options such as custom MSBuild tasks, add-ins, VSPackages, etc. and finally settled on a Visual Studio Package that implemented a project subtype, a custom project property page, and a custom tool (single-file generator).",
        "categories": ["General Development"],
        "tags": ["vs2005"]
      },
      "mps-sdk-part-2-of": {
        "layout": "../_tech_post",
        "date": "June 5, 2006",
        "title": "MPS SDK Part 2 of ?",
        "excerpt": "I am preparing to give a talk/introduction to the MPS SDK at the end of this week based on the outline below. I thought I'd list some of the thoughts/comments here under each of the points as a general resource for anyone interested. In this post, I'll list my outline and then expand on the first points with subsequent posts expanding on the remaining points.",
        "categories": ["Provisioning"],
        "tags": ["mps"]
      },
      "new-sdk-for-the-microsoft-provisioning-system": {
        "layout": "../_tech_post",
        "date": "May 26, 2006",
        "title": "New SDK for the Microsoft Provisioning System!",
        "excerpt": "I’ve recently received clearance to discuss a project I’ve been working on for quite awhile – a new SDK for the Microsoft Provisioning System. This is something that has been a goal of mine for a number of years, and if you have done any significant development for/with MPS you will be glad to hear that the developer tool set is finally going to be shipping (no, don’t ask me when – but it shouldn’t be too long).",
        "categories": ["Provisioning"],
        "tags": ["mps"]
      },
      "using-xsd-in-your-c-and-mps-programming": {
        "layout": "../_tech_post",
        "date": "January 14, 2006",
        "title": "Using XSD in your C# and MPS programming...",
        "excerpt": "So I need to begin this post by admitting that I’m relatively new to the XSD world… particularly as it applies to C#. While I’ve done a significant amount of Xml programming and manipulation in C#, my recent forays into this technology cause me to reconsider my belief that I’m an experienced Xml programmer…",
        "categories": ["General Development"],
        "tags": ["c#", "mps"]
      }
    },
    "_2007": {

    },
    "_2008": {

    },
    "_2009": {

    },
    "_2010": {

    },
    "_2011": {

    },
    "_2012": {

    },
    "_2013": {

    },
    "_2014": {

    }
  }
}
