{
  "what-im-looking-for": {
    "layout": "../_tech_post",
    "date": "November 1, 2007",
    "title": "What I'm looking for...",
    "excerpt": "In a number of the posts I've been writing on the SOA/BPM conference I've referred to the applicability (or lack thereof) of a given approach to \"the problem set\" that I'm currently working on. I thought it might be good to describe what it is that I'm looking for and a little bit as to why.",
    "categories": ["Conferences"],
    "tags": ["bpm", "soa"]
  },
  "msftbpmsoa-session-6": {
    "layout": "../_tech_post",
    "date": "November 1, 2007",
    "title": "MSFT/BPM/SOA Session 6",
    "excerpt": "The sixth session I attended was entitled \"Next Generation Business Applications\" and was presented by Mike Walker of the Architecture Strategy Team (MSFT).",
    "categories": ["Conferences"],
    "tags": ["sharepoint", "soa"]
  },
  "msftbpmsoa-session-5": {
    "layout": "../_tech_post",
    "date": "November 1, 2007",
    "title": "MSFT/BPM/SOA Session 5",
    "excerpt": "This session was titled: \"The Human-Facing SOA: Realizing the Value of Web Services with Microsoft Office SharePoint Server 2007\" presented by Hugh Taylor (Senior Marketing Manager, MSFT)",
    "categories": ["Conferences"],
    "tags": ["sharepoint", "soa"]
  },
  "msftbpmsoa-session-4": {
    "layout": "../_tech_post",
    "date": "October 31, 2007",
    "title": "MSFT/BPM/SOA Session 4",
    "excerpt": "The fourth session I attended was titled \"BPM Best of Breed: Accenture, Avanade, IDS Scheer, and Microsoft - Delivering Closed Loop BPM\" and was presented by Brian Wilkinson (Accenture), Altan Enginaleve (IDS Scheer) and Dana Kaufman (Microsoft).",
    "categories": ["Conferences"],
    "tags": ["sharepoint", "soa"]
  },
  "msftbpmsoa-session-3": {
    "layout": "../_tech_post",
    "date": "October 31, 2007",
    "title": "MSFT/BPM/SOA Session 3",
    "excerpt": "The third session I attended was a lunch session sponsored by K2 (http://www.k2.com). I was looking forward to this presentation as I've heard quite a bit about K2, and they've been doing workflow in SharePoint long before MSFT was.",
    "categories": ["Conferences"],
    "tags": ["sharepoint", "soa"]
  },
  "msftbpm-session-2": {
    "layout": "../_tech_post",
    "date": "October 31, 2007",
    "title": "MSFT/BPM Session 2",
    "excerpt": "The section session I attended was entitled \"People-Read Processes with SharePoint Workflows and Forms Services\" and was presented by Christian Stark, a Senior Product Manager for Microsoft.",
    "categories": ["Conferences"],
    "tags": ["soa"]
  },
  "msftbpm-session-1": {
    "layout": "../_tech_post",
    "date": "October 31, 2007",
    "title": "MSFT/BPM Session 1",
    "excerpt": "Today started out with the keynote for the conference and it was certainly not disappointing. The following is basically a brain dump of the information presented along with some commentary.",
    "categories": ["Conferences"],
    "tags": ["soa"]
  },
  "microsofts-fifth-annual-soa-and-bpm-conference": {
    "layout": "../_tech_post",
    "date": "October 30, 2007",
    "title": "Microsoft's Fifth Annual SOA and BPM Conference",
    "excerpt": "I'm in Redmond this week attending Microsoft's fifth annual SOA and BPM conference. It's pretty interesting so far, and I'm intending on writing a number of different posts (one per session that I attend). For the last nine months I've been working in the federal IT",
    "categories": ["Conferences"],
    "tags": ["soa"]
  },
  "base-template-for-moss-master-pages": {
    "layout": "../_tech_post",
    "date": "April 19, 2007",
    "title": "Base Template for MOSS Master Pages",
    "excerpt": "I'm posting this more for my own benefit (able to find it later) than anything, but while working on a master page customization for a client I stumbled across a posting on MSDN on how to create a minimal master page",
    "categories": ["General Development"],
    "tags": ["sharepoint"]
  },
  "why-cant-i-create-a-master-page-in-the-site-collection": {
    "layout": "../_tech_post",
    "date": "April 19, 2007",
    "title": "Why Can't I Create a Master Page in the Site Collection???",
    "excerpt": "Chalk it up to being a newbie at SharePoint v3/MOSS 2007 development, but I expected that since I was a site \"owner\" of both a sub-site as well as the site collection that I should be able to create a master page using SPD and save it to the site collection's master page gallery",
    "categories": ["General Development"],
    "tags": ["sharepoint"]
  },
  "sql-server-2005-compact-edition-kudos-to-the-sql-team": {
    "layout": "../_tech_post",
    "date": "January 24, 2007",
    "title": "SQL Server 2005 Compact Edition - Kudos to the SQL Team",
    "excerpt": "If you track the Microsoft or ASP.NET weblogs you've surely noticed that roughly two weeks ago now Microsoft released SSCE or SQL Server 2005 Compact Edition. Rather than simply saying \"they released it, go download it because it's cool\" I want to openly thank the SQL team for providing a very interesting product.",
    "categories": ["General Development"],
    "tags": ["sql"]
  },
  "index" : {
    "layout": "index"
  }
}

