{
  "pdc05-dotnetnuke-the-migration-to-aspnet-20": {
    "layout": "../_tech_post",
    "date": "September 13, 2005",
    "title": "PDC05: DotNetNuke - The Migration to ASP.NET 2.0",
    "excerpt": "The last session I attended today was called a \"Birds of a feather\" session... this is much less formal and is sort of a community-style meeting. This session was great as I had many questions and the opportunity to sit and listen to the authors of DNN discuss their thoughts and directions for the product, as well as to see that they are truly interested in the feedback from the community was simply great.",
    "categories": ["Conferences", "General Development"],
    "tags": ["asp.net"]
  },
  "pdc05-extending-visual-studio-with-add-ins-and-packages": {
    "layout": "../_tech_post",
    "date": "September 13, 2005",
    "title": "PDC05: Extending Visual Studio with Add-ins and Packages",
    "excerpt": "The last “main” session I attended today was on extending the Visual Studio .NET IDE.  This session was of particular interest to me as I’ve dabbled with the VSIP for quite some time now and never been able to get anything truly of interest working.  I listened intently as they described the improvements in the VSIP (now the VS.NET SDK) in the latest versions.",
    "categories": ["Conferences", "General Development"],
    "tags": ["visualstudio"]
  },
  "pdc05-choosing-the-right-presentation-technology": {
    "layout": "../_tech_post",
    "date": "September 13, 2005",
    "title": "PDC05: Choosing the Right Presentation Technology",
    "excerpt": "The second break-out session I attended today was called “Choosing the Right Presentation Technology: Windows Presentation Foundation (\"Avalon\"), Windows Forms, ASP.NET, IE, and More”.  The speaker was great and really seemed to know his stuff.",
    "categories": ["Conferences"],
    "tags": ["wpf"]
  },
  "pdc05-windows-communications-foundation-indigo": {
    "layout": "../_tech_post",
    "date": "September 13, 2005",
    "title": "PDC05: Windows Communications Foundation (\"Indigo\")",
    "excerpt": "Because the keynote went long today, they rescheduled the lunch sessions so my second session of the day was called Windows Communications Foundation (\"Indigo\"): A Lap around the Windows Communications Foundation. Unfortunately, I felt the session was nearly a complete waste of time.  Besides the fact that the speaker seemed less than prepared (truly seemed surprised by some of his demo results), the demo and content did not “gell” well. ",
    "categories": ["Conferences"],
    "tags": ["wcf"]
  },
  "pdc05-day-1-keynote": {
    "layout": "../_tech_post",
    "date": "September 13, 2005",
    "title": "PDC05: Day 1 Keynote",
    "excerpt": "The keynote for PDC05 today was great.  It started out with Bill Gates (this is the first time I’ve heard him speak in person).  He was followed by Jim Alchin.  Between the two of them, we saw some great demos and heard some really encouraging things.  The following is a list of key points that I came away with from the session:",
    "categories": ["Conferences"],
    "tags": ["fun"]
  },
  "im-at-pdc": {
    "layout": "../_tech_post",
    "date": "September 12, 2005",
    "title": "I'm at PDC!",
    "excerpt": "Well, not actually, but I’m close.  I’m certain that there will be a ton of people posting about PDC05, and those who attended the pre-sessions probably already are.  I arrived this afternoon in time to go down and get registered so I can skip that in the morning… I’ve been spending this evening working through the schedule and trying to determine which sessions to go to (there are so many!).",
    "categories": ["Conferences"],
    "tags": ["fun"]
  },

  "writing-mpf-schemas-is-easier-now-using-vs-2005": {
    "layout": "../_tech_post",
    "date": "July 19, 2005",
    "title": "Writing MPF Schemas is easier now using VS 2005",
    "excerpt": "I know many people do not take the time to include schemas in their MPF named procedures, but I am a big fan.  Here at eQuest, we use these in-line schemas for all sorts of things ranging from auto-generating CHM files to auto-generating strongly-typed C# and XML Web Service wrappers.",
    "categories": ["Provisioning"],
    "tags": ["mps", "vs2005"]
  },
  "web-service-studio": {
    "layout": "../_tech_post",
    "date": "April 22, 2005",
    "title": "Web Service Studio",
    "excerpt": "Those of you who interact with and develop XML web services on a regular basis are probably very familiar with this tool or have other tools that you have purchased/developed to provide similar functionality, but I came across the Web Service Studio",
    "categories": ["General Development"],
    "tags": ["tools"]
  },
  "visualstudionet2005beta2firstexperience-reallygood": {
    "layout": "../_tech_post",
    "date": "April 21, 2005",
    "title": "VisualStudio.Net.2005.Beta2(firstExperience) == Really.Good;",
    "excerpt": "Wow… early this morning was the first time that I was really able to spend some time with the new Visual Studio 2005 beta… and let me join the majority of the blogsphere in saying that I’m quite impressed.  My task today was a simple one… that of converting a primarily content-focused website that I had build using Dreamweaver MX to ASP.NET 2.0.  The following are some general impressions…",
    "categories": ["General Development"],
    "tags": ["vs2005", "tools"]
  },
  "so-infopath-is-useful": {
    "layout": "../_tech_post",
    "date": "January 23, 2005",
    "title": "So... InfoPath IS useful....",
    "excerpt": "One of the unfortunate realities of being a busy consultant and developer is that your exposure to technologies and tools are often limited to what you have to have to use to get your job done, or what your client needs and/or is interested in.  Obviously, you work hard to keep yourself exposed to as much and varied technology as possible, however some things invariably slip through the cracks.",
    "categories": ["General Development"],
    "tags": ["infopath", "tools"]
  },
  "index" : {
    "layout": "index"
  }
}

