{
  "aspnet-20-debugging-steps-i-should-really-know": {
    "layout": "../_tech_post",
    "date": "November 8, 2006",
    "title": "ASP.NET 2.0 Debugging steps I should really know",
    "excerpt": "As part of my \"not-my-real-job\" time, I do a little website hosting - basically to keep my hands dirty with the problem space and to increase my visibility into the windows hosting space. One of the sites we host updated their site this past week with a new CMS platform and the site failed to work. On the site owners development machine the site worked fine... on my dev/test machine the site worked fine but on the production server it failed every time.",
    "categories": ["General Development"],
    "tags": ["asp.net"]
  },
  "vs-2005-project-subtypes": {
    "layout": "../_tech_post",
    "date": "June 15, 2006",
    "title": "VS 2005 Project Subtypes",
    "excerpt": "I’ve had the opportunity lately to work on a project that needed to generate some code for a project based on a given file within the project and then include/add those files to the project for inclusion during build. We spent a good bit of time looking at the various options such as custom MSBuild tasks, add-ins, VSPackages, etc. and finally settled on a Visual Studio Package that implemented a project subtype, a custom project property page, and a custom tool (single-file generator).",
    "categories": ["General Development"],
    "tags": ["vs2005"]
  },
  "mps-sdk-part-2-of": {
    "layout": "../_tech_post",
    "date": "June 5, 2006",
    "title": "MPS SDK Part 2 of ?",
    "excerpt": "I am preparing to give a talk/introduction to the MPS SDK at the end of this week based on the outline below. I thought I'd list some of the thoughts/comments here under each of the points as a general resource for anyone interested. In this post, I'll list my outline and then expand on the first points with subsequent posts expanding on the remaining points.",
    "categories": ["Provisioning"],
    "tags": ["mps"]
  },
  "new-sdk-for-the-microsoft-provisioning-system": {
    "layout": "../_tech_post",
    "date": "May 26, 2006",
    "title": "New SDK for the Microsoft Provisioning System!",
    "excerpt": "I’ve recently received clearance to discuss a project I’ve been working on for quite awhile – a new SDK for the Microsoft Provisioning System. This is something that has been a goal of mine for a number of years, and if you have done any significant development for/with MPS you will be glad to hear that the developer tool set is finally going to be shipping (no, don’t ask me when – but it shouldn’t be too long).",
    "categories": ["Provisioning"],
    "tags": ["mps"]
  },
  "using-xsd-in-your-c-and-mps-programming": {
    "layout": "../_tech_post",
    "date": "January 14, 2006",
    "title": "Using XSD in your C# and MPS programming...",
    "excerpt": "So I need to begin this post by admitting that I’m relatively new to the XSD world… particularly as it applies to C#. While I’ve done a significant amount of Xml programming and manipulation in C#, my recent forays into this technology cause me to reconsider my belief that I’m an experienced Xml programmer…",
    "categories": ["General Development"],
    "tags": ["c#", "mps"]
  },
  "index" : {
    "layout": "index"
  }
}

