{
  "would-you-like-a-cassette-for-your-data": {
    "layout": "../_tech_post",
    "date": "November 1, 2012",
    "title": "Would you like a Cassette for your data?",
    "excerpt": "A colleague of mine sent me a link to this story about using cassettes for storing data and asked for my thoughts. This was clearly a good-natured jab at me in light of a prior conversation we had debating the appropriateness of tape or disk for a research data storage platform. I had been arguing against tape as an out-moded and inappropriate storage mechanism.",
    "categories": ["Miscellaneous"],
    "tags": ["bigdata"]
  },
  "debugging-and-reversing-basics-001": {
    "layout": "../_tech_post",
    "date": "October 15, 2012",
    "title": "Debugging and Reversing Basics 0.01",
    "excerpt": "A colleague of mine sent me a link to this story about using cassettes for storing data and asked for my thoughts. This was clearly a good-natured jab at me in light of a prior conversation we had debating the appropriateness of tape or disk for a research data storage platform. I had been arguing against tape as an out-moded and inappropriate storage mechanism.",
    "categories": ["Security"],
    "tags": ["grayhat", "security", "windows"]
  },
  "devlink-wireless-network-security": {
    "layout": "../_tech_post",
    "date": "August 31, 2012",
    "title": "DevLink: Wireless Network Security",
    "excerpt": "On Wednesday I had the privilege of speaking at DevLink on the topic of wireless network security. I had a great time giving the talk and had great audience participation (including some who were unknowning victims to my man-in-the-middle attack). The slides from the talk are posted below.",
    "categories": ["Conferences"],
    "tags": ["devlink", "security", "wireless"]
  },
  "windows-8-release-preview-on-samsung-slate": {
    "layout": "../_tech_post",
    "date": "July 10, 2012",
    "title": "Windows 8 Release Preview on Samsung Slate",
    "excerpt": "I've been playing with Windows 8 on a Samsung 700T1A slate for a number of months and was quite excited with the Release Preview was announced and attempted to install it straight away. Unfortunately, I was unable to get it installed right away and set it aside for awhile, trying occasionally, failing, and setting it aside.",
    "categories": ["Miscellaneous"],
    "tags": ["windows8"]
  },
  "codestock-2012-buffer-overflow-attack": {
    "layout": "../_tech_post",
    "date": "June 17, 2012",
    "title": "CodeStock 2012: Buffer Overflow Attack",
    "excerpt": "We had a great time at CodeStock a few days ago discussing buffer overflow attacks, showing developers how they are discovered and exploited and a bit about how to avoid creating software that is vulnerable to these types of attacks. Below are the slides and video from the session",
    "categories": ["Conferences"],
    "tags": ["security"]
  },
  "codestock-2012-you-think-your-wifi-is-safe": {
    "layout": "../_tech_post",
    "date": "June 17, 2012",
    "title": "CodeStock 2012: You Think Your WiFi is Safe?",
    "excerpt": "This past Friday I had the privilege of speaking on WiFi security at CodeStock 2012. I had a blast both preparing for the talk and delivering it and I hope it was beneficial to some of those who attended.",
    "categories": ["Conferences"],
    "tags": ["security"]
  },
  "manually-interacting-with-the-msf-database": {
    "layout": "../_tech_post",
    "date": "April 16, 2012",
    "title": "Manually Interacting with the MSF database",
    "excerpt": "This past Friday I had the privilege of speaking on WiFi security at CodeStock 2012. I had a blast both preparing for the talk and delivering it and I hope it was beneficial to some of those who attended.",
    "categories": [],
    "tags": ["security"]
  },
  "building-my-personal-cloud": {
    "layout": "../_tech_post",
    "date": "April 12, 2012",
    "title": "Building My Personal Cloud",
    "excerpt": "This is a bit of an odd post in that it is more a “wondering aloud” then anything specifically prescriptive or informative. I was asked yesterday by a student if I knew of a Windows box he could use to test something on. It was a simple request – he had been building an application on his Mac, and before handing it over to be used, wanted to validate that it worked on Windows. It had the one unique requirement that it had to run on our network at Work due to accessing some IP-restricted content.  The “official” answer was to have him contact our help desk and they would set him up, however the answers he got from them were (understandably) geared towards long-term use of a Windows “desktop” … and came with the associated costs (licenses, labor, etc.).",
    "categories": ["Cloud Computing"],
    "tags": ["cloud"]
  },
  "speaking-at-codestock-2012": {
    "layout": "../_tech_post",
    "date": "April 9, 2012",
    "title": "Speaking at CodeStock 2012",
    "excerpt": "It’s that time of year again… the CodeStock session line up has been announced and – much like years past, it is looking to be a great conference. If you’ve not attended CodeStock before, or are not familiar with what it is, it’s a great regional developer conference hosted in Knoxville, TN early each summer. You can see a list of the content that will be covered at this year’s conference here: http://codestock.org/Sessions/Default.aspx – that’s a lot of content crammed into two days – and a great value at only $60.",
    "categories": ["Conferences"],
    "tags": ["codestock", "security"]
  },
  "index" : {
    "layout": "index"
  }
}

